; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob99) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate6)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate2)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot1)
	(clear pallet6)
	(at pallet7 depot0)
	(clear crate7)
	(at pallet8 depot1)
	(clear crate0)
	(at pallet9 depot2)
	(clear pallet9)
	(at pallet10 depot2)
	(clear pallet10)
	(at truck0 depot1)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 depot1)
	(available hoist7)
	(at crate0 depot1)
	(on crate0 pallet8)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 depot2)
	(on crate2 pallet2)
	(at crate3 depot0)
	(on crate3 pallet7)
	(at crate4 distributor1)
	(on crate4 pallet4)
	(at crate5 depot0)
	(on crate5 crate1)
	(at crate6 depot0)
	(on crate6 crate5)
	(at crate7 depot0)
	(on crate7 crate3)
)

(:goal (and
		(on crate0 pallet9)
		(on crate1 pallet1)
		(on crate2 crate7)
		(on crate3 crate4)
		(on crate4 crate2)
		(on crate6 pallet0)
		(on crate7 pallet4)
	)
))

; plan
1. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 0 of 7
2. (lift hoist7 crate0 pallet8 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist7) (on crate0 pallet8)
   added: (lifting hoist7 crate0) (clear pallet8)
   goals met: 0 of 7
3. (load hoist7 crate0 truck0 depot1)
   deleted: (lifting hoist7 crate0)
   added: (in crate0 truck0) (available hoist7)
   goals met: 0 of 7
4. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   goals met: 0 of 7
5. (unload hoist2 crate0 truck0 depot2)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   goals met: 0 of 7
6. (drop hoist2 crate0 pallet9 depot2)
   deleted: (lifting hoist2 crate0) (clear pallet9)
   added: (available hoist2) (at crate0 depot2) (clear crate0) (on crate0 pallet9)
   goals met: 1 of 7
7. (lift hoist4 crate4 pallet4 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist4) (on crate4 pallet4)
   added: (lifting hoist4 crate4) (clear pallet4)
   goals met: 1 of 7
8. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 1 of 7
9. (load hoist4 crate4 truck0 distributor1)
   deleted: (lifting hoist4 crate4)
   added: (in crate4 truck0) (available hoist4)
   goals met: 1 of 7
10. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 1 of 7
11. (unload hoist2 crate4 truck0 depot2)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   goals met: 1 of 7
12. (drop hoist2 crate4 crate2 depot2)
   deleted: (lifting hoist2 crate4) (clear crate2)
   added: (available hoist2) (at crate4 depot2) (clear crate4) (on crate4 crate2)
   goals met: 2 of 7
13. (lift hoist0 crate6 crate5 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate5)
   added: (lifting hoist0 crate6) (clear crate5)
   goals met: 2 of 7
14. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   goals met: 2 of 7
15. (lift hoist0 crate7 crate3 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate3)
   added: (lifting hoist0 crate7) (clear crate3)
   goals met: 2 of 7
16. (load hoist0 crate7 truck1 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck1) (available hoist0)
   goals met: 2 of 7
17. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 2 of 7
18. (unload hoist4 crate7 truck1 distributor1)
   deleted: (in crate7 truck1) (available hoist4)
   added: (lifting hoist4 crate7)
   goals met: 2 of 7
19. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 2 of 7
20. (drop hoist4 crate7 pallet4 distributor1)
   deleted: (lifting hoist4 crate7) (clear pallet4)
   added: (available hoist4) (at crate7 distributor1) (clear crate7) (on crate7 pallet4)
   goals met: 3 of 7
21. (lift hoist0 crate3 pallet7 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet7)
   added: (lifting hoist0 crate3) (clear pallet7)
   goals met: 3 of 7
22. (load hoist0 crate3 truck1 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck1) (available hoist0)
   goals met: 3 of 7
23. (lift hoist0 crate5 crate1 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate1)
   added: (lifting hoist0 crate5) (clear crate1)
   goals met: 3 of 7
24. (drop hoist0 crate5 pallet7 depot0)
   deleted: (lifting hoist0 crate5) (clear pallet7)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 pallet7)
   goals met: 3 of 7
25. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 3 of 7
26. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 3 of 7
27. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   goals met: 3 of 7
28. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 3 of 7
29. (unload hoist7 crate1 truck1 depot1)
   deleted: (in crate1 truck1) (available hoist7)
   added: (lifting hoist7 crate1)
   goals met: 3 of 7
30. (drop hoist0 crate6 pallet0 depot0)
   deleted: (lifting hoist0 crate6) (clear pallet0)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 4 of 7
31. (drop hoist7 crate1 pallet1 depot1)
   deleted: (lifting hoist7 crate1) (clear pallet1)
   added: (available hoist7) (at crate1 depot1) (clear crate1) (on crate1 pallet1)
   goals met: 5 of 7
32. (lift hoist2 crate4 crate2 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 crate2)
   added: (lifting hoist2 crate4) (clear crate2)
   goals met: 4 of 7
33. (load hoist2 crate4 truck0 depot2)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   goals met: 4 of 7
34. (lift hoist2 crate2 pallet2 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   goals met: 4 of 7
35. (unload hoist7 crate3 truck1 depot1)
   deleted: (in crate3 truck1) (available hoist7)
   added: (lifting hoist7 crate3)
   goals met: 4 of 7
36. (load hoist2 crate2 truck0 depot2)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   goals met: 4 of 7
37. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   goals met: 4 of 7
38. (unload hoist1 crate4 truck0 depot1)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 4 of 7
39. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 4 of 7
40. (unload hoist4 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist4)
   added: (lifting hoist4 crate2)
   goals met: 4 of 7
41. (drop hoist1 crate4 pallet6 depot1)
   deleted: (lifting hoist1 crate4) (clear pallet6)
   added: (available hoist1) (at crate4 depot1) (clear crate4) (on crate4 pallet6)
   goals met: 4 of 7
42. (drop hoist4 crate2 crate7 distributor1)
   deleted: (lifting hoist4 crate2) (clear crate7)
   added: (available hoist4) (at crate2 distributor1) (clear crate2) (on crate2 crate7)
   goals met: 5 of 7
43. (lift hoist1 crate4 pallet6 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist1) (on crate4 pallet6)
   added: (lifting hoist1 crate4) (clear pallet6)
   goals met: 5 of 7
44. (load hoist1 crate4 truck1 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   goals met: 5 of 7
45. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 5 of 7
46. (unload hoist4 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist4)
   added: (lifting hoist4 crate4)
   goals met: 5 of 7
47. (drop hoist4 crate4 crate2 distributor1)
   deleted: (lifting hoist4 crate4) (clear crate2)
   added: (available hoist4) (at crate4 distributor1) (clear crate4) (on crate4 crate2)
   goals met: 6 of 7
48. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 6 of 7
49. (load hoist7 crate3 truck0 depot1)
   deleted: (lifting hoist7 crate3)
   added: (in crate3 truck0) (available hoist7)
   goals met: 6 of 7
50. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 6 of 7
51. (unload hoist4 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist4)
   added: (lifting hoist4 crate3)
   goals met: 6 of 7
52. (drop hoist4 crate3 crate4 distributor1)
   deleted: (lifting hoist4 crate3) (clear crate4)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 crate4)
   goals met: 7 of 7
